content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
#+Title: Looking at three high level patterns in CFEngine 3
#+AUTHOR: Nick Anderson
#+DATE: 2018-11-10
#+TAGS: cfengine3 cfengine
#+DRAFT: false

How do you deal with config files that need different settings based on various
services that are running on a host and cooperate with other teams? It's a
common question, and it came up on in #cfengine on irc.freenode.net recently.

#+BEGIN_QUOTE
  The issue is that team A might be working on package A, which requires some
  environment variables set. But team B might be working on a totally different
  thing -- and want to achieve the same thing. I hoped to give them a bit of
  'library' code to take care of it, rather than have them touch a centralized
  environment-setting policy file.
#+END_QUOTE

Here, I look at three high level patterns I have seen.

- Competitive management :: Each bundle that needs a specific config manages it
     by itself, typically by using a parameterized bundle.

- Centralized management :: All config definition is in a single place, anyone
     needing something edits the global config.

- Cooperative management :: Each bundle that needs a specific config, publishes
     the config it needs, and another policy handles consolidating the configs
     and edits the config as necessary.

Let's take a look at an example of each of these patterns. I will start from an
example recently shared in #cfengine on irc.freenode.net that manages
=/etc/environment=, =/etc/sysstemd.conf=, and =/etc/profile=. I'll first fix it,
so that it works, then show several different patterns that ac hive the smae
goal.

