public/2018/11/10/looking-at-three-high-level-patterns-in-cfengine-3/index.html
<!DOCTYPE html>
<html>

    <head>
        <title> Looking at three high level patterns in CFEngine 3 &middot;  </title>

        <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="generator" content="Hugo 0.92.2" />






<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-+0n0xVW2eSR5OomGNYDnhzAbDsOXxcvSN1TPprVMTNDbiYZCxYbOOl7+AMvyTG2x" crossorigin="anonymous">


<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css" integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous">


<link rel="stylesheet" href="https://cmdln.org/css/nix.css">





<link href="https://fonts.googleapis.com/css?family=Inconsolata%7COpen+Sans%7CConcert+One" rel="stylesheet">






    </head>

    <body>
        <header>
	<nav class="navbar navbar-dark bg-dark fixed-top navbar-expand-lg font-header">
		<div class="container-fluid">
			<a class="navbar-brand" id="green-terminal" href='https://cmdln.org/'>
				nick@cmdln.org ~ $
			</a>
			<button type="button" class="navbar-toggler" data-bs-toggle="collapse" data-bs-target="#navbar-collapse-1" 
					aria-controls="navbar-collapse-1" aria-expanded="false">
				<span class="visually-hidden">Toggle navigation</span>
				<span class="navbar-toggler-icon"></span>
			</button>
	
			
			<div class="collapse navbar-collapse" id="navbar-collapse-1">
				<ul class="nav navbar-nav ms-auto">
					<li class="nav-item">
						<a class="nav-link" href='https://cmdln.org/'>
							/home/nick</a>
					</li>
					
					
					
					<li class="nav-item dropdown">
						
						<a class="nav-link" href="https://cmdln.org/post/">~/posts</a>
						
					</li>
					
				</ul>
			</div>
		</div>
	</nav>
</header>

        <div class="flex-wrapper">
            <div class="container wrapper">
                <h1><a href="https://cmdln.org/2018/11/10/looking-at-three-high-level-patterns-in-cfengine-3/">Looking at three high level patterns in CFEngine 3</a></h1>
                <span class="post-date">2018-11-10 </span>
                <div class="post-content">
                    
<p>
How do you deal with config files that need different settings based on various
services that are running on a host and cooperate with other teams? It&#39;s a
common question, and it came up on in #cfengine on irc.freenode.net recently.</p>
<blockquote>
<p>The issue is that team A might be working on package A, which requires some
  environment variables set. But team B might be working on a totally different
  thing – and want to achieve the same thing. I hoped to give them a bit of
  &#39;library&#39; code to take care of it, rather than have them touch a centralized
  environment-setting policy file.</p>
</blockquote>
<p>
Here, I look at three high level patterns I have seen.</p>
<dl>
<dt>
Competitive management
</dt>
<dd>Each bundle that needs a specific config manages it
by itself, typically by using a parameterized bundle.</dd>
<dt>
Centralized management
</dt>
<dd>All config definition is in a single place, anyone
needing something edits the global config.</dd>
<dt>
Cooperative management
</dt>
<dd>Each bundle that needs a specific config, publishes
the config it needs, and another policy handles consolidating the configs
and edits the config as necessary.</dd>
</dl>
<p>Let&#39;s take a look at an example of each of these patterns. I will start from an
example recently shared in #cfengine on irc.freenode.net that manages
<code class="verbatim">/etc/environment</code>, <code class="verbatim">/etc/sysstemd.conf</code>, and <code class="verbatim">/etc/profile</code>. I&#39;ll first fix it,
so that it works, then show several different patterns that ac hive the smae
goal.</p>
