content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
* The original example

#+BEGIN_QUOTE
  Hello everyone. I am trying to use set_line_based to set some "global"
  environment variables. I've created a bundle that I thought might make it
  easier. However, using this bundle more than once only applies the first
  'invocation'. Code here: https://pastebin.com/mbU1Bb6i
#+END_QUOTE

*Example usage:*

#+Caption: bundle agent vagrant_vm
#+BEGIN_SRC cfengine3
  bundle agent vagrant_vm
  {
    meta:
        "tags" slist => {
                          "autorun"
        };
    methods:
        "unifi";
        "any" usebundle => global_env("PAPERTRAIL_HOST",  "xxx.papertrailapp.com");
        "any" usebundle => global_env("PAPERTRAIL_PORT",  "12345");
        "any" usebundle => global_env("APPOPTICS_USER",   "ops@whatever.com");
        "any" usebundle => global_env("APPOPTICS_APIKEY", "cafebabedeadbeef");
        "any" usebundle => global_env("CORE_JDBC_URL",    "jdbc:postgresql://localhost/xxx");
        "any" usebundle => global_env("CORE_JDBC_USER",   "vagrant");
        "any" usebundle => global_env("SMS_ENABLED",      "false");
        "any" usebundle => global_env("SMS_AWS_REGION",   "eu-west-1");
  }
#+END_SRC

*Implementation:*

#+Caption: bundle agent global_env(name, value)
#+BEGIN_SRC cfengine3
  bundle agent global_env(name, value)
  {
    vars:
        "etcenv[$(name)]" string => "$(value)";
        "systemconf[DefaultEnvironment=$(name)]" string => "$(value)";
        "etcprofile[export $(name)]" string => "$(value)";
      
    files:
        "/etc/environment"
          edit_line => set_line_based("global_env.etcenv", "=", "\s*=\s*", ".*", "\s*#\s*");
        "/etc/systemd/system.conf"
          edit_line => set_line_based("global_env.systemconf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          classes   => if_repaired("system_conf_changed");
        "/etc/profile"
          edit_line => set_line_based("global_env.etcprofile", "=", "\s*=\s*", ".*", "\s*#\s*");

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root");
  }
#+END_SRC

The reason that only the first actuation of =global_env= alters the file is
because the promise does not differ. Once a promise has been kept or repaired,
it is not actuated again within the same agent run. The promise can be made
unique by including the parameters which are different between actuation's in
the promise. Here we add a handle using both parameters, so that the promise is
unique across actuation's of the bundle for different values of =name= and
=value=.

#+BEGIN_SRC cfengine3
  "/etc/environment"
    edit_line => set_line_based("global_env.etcenv", "=", "\s*=\s*", ".*", "\s*#\s*"),
    handle => "etc_environment_$(name)_$(value)";
#+END_SRC

I will combine them together into the same policy file and make some minor
changes.

- I added handles using the parameters to make sure that the promises are unique
  across executions with different parameter values. For more on this, see the
  [[https://docs.cfengine.com/docs/3.12/reference-language-concepts-bundles.html][language concepts for bundles]], it discusses how bundles are not functions.

- I added =bundle agent __main__= so that the =vagrant_vm= bundle will be
  actuated when this policy file is run directly.
  
- I removed the =unifi= methods promise because it was not provided in the
  original example.

- I added reports that show the complete content of the files for easy
  demonstration.
  
- I include the stdlib for my executions, you don't see it, but know that it's
  in use.

- I guard the ~systemd daemon-reload~ with a check that the executing user is
  root because I prototype policy as my own user, inside org-mode using
  [[https://github.com/nickanderson/ob-cfengine3][ob-cfengine3]] (shameless plug).
  
- I add an init bundle to reset as if running from a clean state with no
  pre-existing configuration.

- I added body contain =exec_owner()= because it isn't in the stdlib.

- I added =create => "true"= to the files promises.

- I prefixed the files promises with =/tmp=.

