public/2018/11/10/looking-at-three-high-level-patterns-in-cfengine-3/index.html
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
The original example
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<blockquote>
<p>Hello everyone. I am trying to use set_line_based to set some &#34;global&#34;
  environment variables. I&#39;ve created a bundle that I thought might make it
  easier. However, using this bundle more than once only applies the first
  &#39;invocation&#39;. Code here: <a href="https://pastebin.com/mbU1Bb6i">https://pastebin.com/mbU1Bb6i</a></p>
</blockquote>
<p>
<strong>Example usage:</strong></p>
<figure>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">vagrant_vm</span>
  <span class="p">{</span>
    <span class="kd">meta</span><span class="p">:</span>
        <span class="p">&#34;</span><span class="nv">tags</span><span class="p">&#34;</span> <span class="kt">slist</span> <span class="o">=&gt;</span> <span class="p">{</span>
                          <span class="s">&#34;autorun&#34;</span>
        <span class="p">};</span>
    <span class="kd">methods</span><span class="p">:</span>
        <span class="s">&#34;unifi&#34;</span><span class="p">;</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;PAPERTRAIL_HOST&#34;</span><span class="p">,</span>  <span class="s">&#34;xxx.papertrailapp.com&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;PAPERTRAIL_PORT&#34;</span><span class="p">,</span>  <span class="s">&#34;12345&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;APPOPTICS_USER&#34;</span><span class="p">,</span>   <span class="s">&#34;ops@whatever.com&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;APPOPTICS_APIKEY&#34;</span><span class="p">,</span> <span class="s">&#34;cafebabedeadbeef&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;CORE_JDBC_URL&#34;</span><span class="p">,</span>    <span class="s">&#34;jdbc:postgresql://localhost/xxx&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;CORE_JDBC_USER&#34;</span><span class="p">,</span>   <span class="s">&#34;vagrant&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;SMS_ENABLED&#34;</span><span class="p">,</span>      <span class="s">&#34;false&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;SMS_AWS_REGION&#34;</span><span class="p">,</span>   <span class="s">&#34;eu-west-1&#34;</span><span class="p">);</span>
  <span class="p">}</span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
bundle agent vagrant_vm
</figcaption>
</figure>
<p>
<strong>Implementation:</strong></p>
<figure>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">global_env</span><span class="p">(</span><span class="nv">name</span><span class="p">,</span> <span class="nv">value</span><span class="p">)</span>
  <span class="p">{</span>
    <span class="kd">vars</span><span class="p">:</span>
        <span class="p">&#34;</span><span class="nv">etcenv[$(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="p">&#34;</span><span class="nv">systemconf[DefaultEnvironment=$(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="p">&#34;</span><span class="nv">etcprofile[export $(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
      
    <span class="kd">files</span><span class="p">:</span>
        <span class="s">&#34;/etc/environment&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.etcenv&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">);</span>
        <span class="s">&#34;/etc/systemd/system.conf&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.systemconf&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">classes</span>   <span class="o">=&gt;</span> <span class="nf">if_repaired</span><span class="p">(</span><span class="s">&#34;system_conf_changed&#34;</span><span class="p">);</span>
        <span class="s">&#34;/etc/profile&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.etcprofile&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">);</span>

    <span class="kd">commands</span><span class="p">:</span>
      <span class="nc">system_conf_changed</span><span class="p">::</span>
        <span class="s">&#34;/sbin/systemctl daemon-reload&#34;</span>
          <span class="kr">contain</span> <span class="o">=&gt;</span> <span class="nf">exec_owner</span><span class="p">(</span><span class="s">&#34;root&#34;</span><span class="p">);</span>
  <span class="p">}</span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
bundle agent global_env(name, value)
</figcaption>
</figure>
<p>
The reason that only the first actuation of <code class="verbatim">global_env</code> alters the file is
because the promise does not differ. Once a promise has been kept or repaired,
it is not actuated again within the same agent run. The promise can be made
unique by including the parameters which are different between actuation&#39;s in
the promise. Here we add a handle using both parameters, so that the promise is
unique across actuation&#39;s of the bundle for different values of <code class="verbatim">name</code> and
<code class="verbatim">value</code>.</p>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3">  <span class="s">&#34;/etc/environment&#34;</span>
    <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.etcenv&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
    <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;etc_environment_</span><span class="si">$(name)</span><span class="s">_</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
I will combine them together into the same policy file and make some minor
changes.</p>
<ul>
<li>I added handles using the parameters to make sure that the promises are unique
across executions with different parameter values. For more on this, see the
<a href="https://docs.cfengine.com/docs/3.12/reference-language-concepts-bundles.html">language concepts for bundles</a>, it discusses how bundles are not functions.</li>
<li>I added <code class="verbatim">bundle agent __main__</code> so that the <code class="verbatim">vagrant_vm</code> bundle will be
actuated when this policy file is run directly.</li>
<li>I removed the <code class="verbatim">unifi</code> methods promise because it was not provided in the
original example.</li>
<li>I added reports that show the complete content of the files for easy
demonstration.</li>
<li>I include the stdlib for my executions, you don&#39;t see it, but know that it&#39;s
in use.</li>
<li>I guard the <code>systemd daemon-reload</code> with a check that the executing user is
root because I prototype policy as my own user, inside org-mode using
<a href="https://github.com/nickanderson/ob-cfengine3">ob-cfengine3</a> (shameless plug).</li>
<li>I add an init bundle to reset as if running from a clean state with no
pre-existing configuration.</li>
<li>I added body contain <code class="verbatim">exec_owner()</code> because it isn&#39;t in the stdlib.</li>
<li>I added <code class="verbatim">create =&gt; &#34;true&#34;</code> to the files promises.</li>
<li>I prefixed the files promises with <code class="verbatim">/tmp</code>.</li>
</ul>
</div>
</div>
