content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
* Competitive management
:PROPERTIES:
:ID:       57de7841-ac78-403a-b646-0e9ac05af7e2
:END:

This is a common pattern. I think of this pattern as competitive because each
service manages what it needs, multiple services may compete for control over
the same resources like configuration files. Each service only worries about
itself, this pattern allows for extra settings to exist in the configuration
files which is beneficial in situations where control must be shared between
multiple agents. This pattern results in files being edited multiple times
within a single agent run which may be useful in ordering, but results in some
overhead. Additionally, depending how the service restart on config change is
managed, may lead to the same service re-starting multiple times in the same
agent run.

*Policy:*

#+Caption: My competitive management pattern example
#+Name: My competitive management pattern example
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env(name, value)
  {
    vars:
        "etcenv[$(name)]" string => "$(value)";
        "systemconf[DefaultEnvironment=$(name)]" string => "$(value)";
        "etcprofile[export $(name)]" string => "$(value)";

    files:

        "/tmp/etc/environment"
          edit_line => set_line_based("global_env.etcenv", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_environment_$(name)_$(value)";

        "/tmp/etc/systemd/system.conf"
          edit_line => set_line_based("global_env.systemconf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          classes   => if_repaired("system_conf_changed"),
          create => "true",
          handle => "_etc_systemd_system_conf_$(name)_$(value)";

        "/tmp/etc/profile"
          edit_line => set_line_based("global_env.etcprofile", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_profile_$(name)_$(value)";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload_$(name)_$(value)";
  }

  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent vagrant_vm
  {
    meta:
        "tags" slist => {
                          "autorun"
        };
    methods:
        "any" usebundle => global_env("PAPERTRAIL_HOST",  "xxx.papertrailapp.com");
        "any" usebundle => global_env("PAPERTRAIL_PORT",  "12345");
        "any" usebundle => global_env("APPOPTICS_USER",   "ops@whatever.com");
        "any" usebundle => global_env("APPOPTICS_APIKEY", "cafebabedeadbeef");
        "any" usebundle => global_env("CORE_JDBC_URL",    "jdbc:postgresql://localhost/xxx");
        "any" usebundle => global_env("CORE_JDBC_USER",   "vagrant");
        "any" usebundle => global_env("SMS_ENABLED",      "false");
        "any" usebundle => global_env("SMS_AWS_REGION",   "eu-west-1");
  }
  bundle agent init 
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    methods:
        "init";
        "vagrant_vm";

    reports:
        "CFEngine $(sys.cf_version)";
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My competitive management pattern example
#+BEGIN_EXAMPLE
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: PAPERTRAIL_PORT=12345
R: APPOPTICS_USER=ops@whatever.com
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: CORE_JDBC_USER=vagrant
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=12345
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: /tmp/etc/profile
R: export PAPERTRAIL_HOST=xxx.papertrailapp.com
R: export PAPERTRAIL_PORT=12345
R: export APPOPTICS_USER=ops@whatever.com
R: export APPOPTICS_APIKEY=cafebabedeadbeef
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export CORE_JDBC_USER=vagrant
R: export SMS_ENABLED=false
R: export SMS_AWS_REGION=eu-west-1
#+END_EXAMPLE

A common evolution for this policy would be to condense the write operations by
altering the parameter to pass a map of key value pairs.

