public/2018/11/10/looking-at-three-high-level-patterns-in-cfengine-3/index.html
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Competitive management
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
This is a common pattern. I think of this pattern as competitive because each
service manages what it needs, multiple services may compete for control over
the same resources like configuration files. Each service only worries about
itself, this pattern allows for extra settings to exist in the configuration
files which is beneficial in situations where control must be shared between
multiple agents. This pattern results in files being edited multiple times
within a single agent run which may be useful in ordering, but results in some
overhead. Additionally, depending how the service restart on config change is
managed, may lead to the same service re-starting multiple times in the same
agent run.</p>
<p>
<strong>Policy:</strong></p>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span><span class="lnt">35
</span><span class="lnt">36
</span><span class="lnt">37
</span><span class="lnt">38
</span><span class="lnt">39
</span><span class="lnt">40
</span><span class="lnt">41
</span><span class="lnt">42
</span><span class="lnt">43
</span><span class="lnt">44
</span><span class="lnt">45
</span><span class="lnt">46
</span><span class="lnt">47
</span><span class="lnt">48
</span><span class="lnt">49
</span><span class="lnt">50
</span><span class="lnt">51
</span><span class="lnt">52
</span><span class="lnt">53
</span><span class="lnt">54
</span><span class="lnt">55
</span><span class="lnt">56
</span><span class="lnt">57
</span><span class="lnt">58
</span><span class="lnt">59
</span><span class="lnt">60
</span><span class="lnt">61
</span><span class="lnt">62
</span><span class="lnt">63
</span><span class="lnt">64
</span><span class="lnt">65
</span><span class="lnt">66
</span><span class="lnt">67
</span><span class="lnt">68
</span><span class="lnt">69
</span><span class="lnt">70
</span><span class="lnt">71
</span><span class="lnt">72
</span><span class="lnt">73
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">global_env</span><span class="p">(</span><span class="nv">name</span><span class="p">,</span> <span class="nv">value</span><span class="p">)</span>
  <span class="p">{</span>
    <span class="kd">vars</span><span class="p">:</span>
        <span class="p">&#34;</span><span class="nv">etcenv[$(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="p">&#34;</span><span class="nv">systemconf[DefaultEnvironment=$(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="p">&#34;</span><span class="nv">etcprofile[export $(name)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>

    <span class="kd">files</span><span class="p">:</span>

        <span class="s">&#34;/tmp/etc/environment&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.etcenv&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_environment_</span><span class="si">$(name)</span><span class="s">_</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>

        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.systemconf&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">classes</span>   <span class="o">=&gt;</span> <span class="nf">if_repaired</span><span class="p">(</span><span class="s">&#34;system_conf_changed&#34;</span><span class="p">),</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_systemd_system_conf_</span><span class="si">$(name)</span><span class="s">_</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>

        <span class="s">&#34;/tmp/etc/profile&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;global_env.etcprofile&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_profile_</span><span class="si">$(name)</span><span class="s">_</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>

    <span class="kd">commands</span><span class="p">:</span>
      <span class="nc">system_conf_changed</span><span class="p">::</span>
        <span class="s">&#34;/sbin/systemctl daemon-reload&#34;</span>
          <span class="kr">contain</span> <span class="o">=&gt;</span> <span class="nf">exec_owner</span><span class="p">(</span><span class="s">&#34;root&#34;</span><span class="p">),</span>
          <span class="kr">if</span> <span class="o">=&gt;</span> <span class="nf">strcmp</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(sys.user_data[username])</span><span class="s">&#34;</span><span class="p">,</span> <span class="s">&#34;root&#34;</span> <span class="p">),</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_sbin_systemctl_daemon_reload_</span><span class="si">$(name)</span><span class="s">_</span><span class="si">$(value)</span><span class="s">&#34;</span><span class="p">;</span>
  <span class="p">}</span>

  <span class="k">body</span> <span class="k">contain</span> <span class="nf">exec_owner</span><span class="p">(</span><span class="nv">user</span><span class="p">)</span>
  <span class="p">{</span>
          <span class="kr">exec_owner</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(user)</span><span class="s">&#34;</span><span class="p">;</span>
  <span class="p">}</span>

  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">vagrant_vm</span>
  <span class="p">{</span>
    <span class="kd">meta</span><span class="p">:</span>
        <span class="p">&#34;</span><span class="nv">tags</span><span class="p">&#34;</span> <span class="kt">slist</span> <span class="o">=&gt;</span> <span class="p">{</span>
                          <span class="s">&#34;autorun&#34;</span>
        <span class="p">};</span>
    <span class="kd">methods</span><span class="p">:</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;PAPERTRAIL_HOST&#34;</span><span class="p">,</span>  <span class="s">&#34;xxx.papertrailapp.com&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;PAPERTRAIL_PORT&#34;</span><span class="p">,</span>  <span class="s">&#34;12345&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;APPOPTICS_USER&#34;</span><span class="p">,</span>   <span class="s">&#34;ops@whatever.com&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;APPOPTICS_APIKEY&#34;</span><span class="p">,</span> <span class="s">&#34;cafebabedeadbeef&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;CORE_JDBC_URL&#34;</span><span class="p">,</span>    <span class="s">&#34;jdbc:postgresql://localhost/xxx&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;CORE_JDBC_USER&#34;</span><span class="p">,</span>   <span class="s">&#34;vagrant&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;SMS_ENABLED&#34;</span><span class="p">,</span>      <span class="s">&#34;false&#34;</span><span class="p">);</span>
        <span class="s">&#34;any&#34;</span> <span class="kr">usebundle</span> <span class="o">=&gt;</span> <span class="nf">global_env</span><span class="p">(</span><span class="s">&#34;SMS_AWS_REGION&#34;</span><span class="p">,</span>   <span class="s">&#34;eu-west-1&#34;</span><span class="p">);</span>
  <span class="p">}</span>
  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">init</span> 
  <span class="p">{</span>
    <span class="kd">files</span><span class="p">:</span>
        <span class="s">&#34;/tmp/etc/environment&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/profile&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
  <span class="p">}</span>
  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">__main__</span>
  <span class="p">{</span>
    <span class="kd">methods</span><span class="p">:</span>
        <span class="s">&#34;init&#34;</span><span class="p">;</span>
        <span class="s">&#34;vagrant_vm&#34;</span><span class="p">;</span>

    <span class="kd">reports</span><span class="p">:</span>
        <span class="s">&#34;CFEngine </span><span class="si">$(sys.cf_version)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/environment&#34;</span>         <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span> <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
        <span class="s">&#34;/tmp/etc/profile&#34;</span>             <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
  <span class="p">}</span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
<strong>Output:</strong></p>
<pre class="example">
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: PAPERTRAIL_PORT=12345
R: APPOPTICS_USER=ops@whatever.com
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: CORE_JDBC_USER=vagrant
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=12345
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: /tmp/etc/profile
R: export PAPERTRAIL_HOST=xxx.papertrailapp.com
R: export PAPERTRAIL_PORT=12345
R: export APPOPTICS_USER=ops@whatever.com
R: export APPOPTICS_APIKEY=cafebabedeadbeef
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export CORE_JDBC_USER=vagrant
R: export SMS_ENABLED=false
R: export SMS_AWS_REGION=eu-west-1
</pre>
<p>
A common evolution for this policy would be to condense the write operations by
altering the parameter to pass a map of key value pairs.</p>
