content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
** Condense the write operations by changing the parameters

A quick change to the parameters allows multiple key values to be set at a
single time, reducing IO.

*Policy:*

#+Caption: My competitive management pattern with map parameter
#+Name: My competitive management pattern example with map parameter
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env(map)
  {
    vars:
        # map is KEY=VAL
        "name" slist => getindices( map );
        "etcenv[$(name)]" string => "$(map[$(name)])";
        "systemconf[DefaultEnvironment=$(name)]" string => "$(map[$(name)])";
        "etcprofile[export $(name)]" string => "$(map[$(name)])";

    files:

        "/tmp/etc/environment"
          edit_line => set_line_based("global_env.etcenv", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_environment_$(name)_$(map[$(name)])";

        "/tmp/etc/systemd/system.conf"
          edit_line => set_line_based("global_env.systemconf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          classes   => if_repaired("system_conf_changed"),
          create => "true",
          handle => "_etc_systemd_system_conf_$(name)_$(map[$(name)])";

        "/tmp/etc/profile"
          edit_line => set_line_based("global_env.etcprofile", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_profile_$(name)_$(map[$(name)])";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload_$(name)_$(map[$(name)])";
  }

  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent vagrant_vm
  {
    meta:
        "tags" slist => {
                          "autorun"
        };

    vars:

              "d" data => '{
    "PAPERTRAIL_HOST": "xxx.papertrailapp.com",
    "PAPERTRAIL_PORT": "12345",
    "APPOPTICS_USER": "ops@whatever.com",
    "APPOPTICS_APIKEY": "cafebabedeadbeef",
    "CORE_JDBC_URL": "jdbc:postgresql://localhost/xxx",
    "CORE_JDBC_USER": "vagrant",
    "SMS_ENABLED": "false",
    "SMS_AWS_REGION": "eu-west-1"
  }';

    methods:
        "any" usebundle => global_env( @(d) );

  }
  bundle agent init
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    methods:
        "init";
        "vagrant_vm";

    reports:
        "CFEngine $(sys.cf_version)";
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My competitive management pattern example with map parameter
#+BEGIN_EXAMPLE
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: APPOPTICS_USER=ops@whatever.com
R: PAPERTRAIL_PORT=12345
R: CORE_JDBC_USER=vagrant
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: SMS_ENABLED=false
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: SMS_AWS_REGION=eu-west-1
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=12345
R: /tmp/etc/profile
R: export SMS_ENABLED=false
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export APPOPTICS_USER=ops@whatever.com
R: export CORE_JDBC_USER=vagrant
R: export SMS_AWS_REGION=eu-west-1
R: export PAPERTRAIL_PORT=12345
R: export APPOPTICS_APIKEY=cafebabedeadbeef
R: export PAPERTRAIL_HOST=xxx.papertrailapp.com
#+END_EXAMPLE

