content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
* Centralized management

Let's take a look at what a centralized management pattern might look like. This
is the simplest pattern, and many times how policies begin as a prototype,
before evolving into another pattern.

We removed the =vagrant_vm= bundle, and the uniqness from the promise handles.
Now, all the configuration data is right in the =global_env= bundle. We use a
classic array as a generator to produce copies of the key values tailored for
each config file. An alternative to creating different variables using a classic
array generator we could copy =set_line_based= and customize it to allow a
prefix to be specified.

*Policy:*

#+Caption: My centralized management pattern example 
#+Name: My centralized management pattern example 
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env
  {
    vars:

      vagrant_vm::

        "env[PAPERTRAIL_HOST]"            string => "xxx.papertrailapp.com";
        "env[PAPERTRAIL_PORT]"            string => "12345";
        "env[APPOPTICS_USER]"            string => "ops@whatever.com";
        "env[APPOPTICS_APIKEY]"            string => "cafebabedeadbeef";
        "env[CORE_JDBC_URL]"            string => "jdbc:postgresql://localhost/xxx";
        "env[CORE_JDBC_USER]"            string => "vagrant";
        "env[SMS_ENABLED]"            string => "false";
        "env[SMS_AWS_REGION]"            string => "eu-west-1";

      application_2::

        "env[PAPERTRAIL_HOST]"            string => "xxx.trailpaperapp.com";
        "env[PAPERTRAIL_PORT]"            string => "54321";
        "env[APPOPTICS_USER]"            string => "ops@whatever.com";
        "env[APPOPTICS_APIKEY]"            string => "xxxxiiiiiiixxixxix";
        "env[CORE_JDBC_URL]"            string => "jdbc:postgresql://localhost/xxx";
        "env[CORE_JDBC_USER]"            string => "vagrant";
        "env[SMS_ENABLED]"            string => "false";
        "env[SMS_AWS_REGION]"            string => "eu-east-2";


      any::

        "env_i" slist => getindices( env );
        # Here we take the original simple key value pair and add different
        # prefixes for the differnt config file types using a classic array as a
        # generator. Alternatively, we could copy set_line_based and customize it
        # allowing for a prefix parameter.
        "systemconf[DefaultEnvironment=$(env_i)]" string => "$(env[$(env_i)])";
        "etcprofile[export $(env_i)]" string => "$(env[$(env_i)])";

    files:

        "/tmp/etc/environment"
          edit_line => set_line_based("global_env.env", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_environment";

        "/tmp/etc/systemd/system.conf"
          edit_line => set_line_based("global_env.systemconf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          classes   => if_repaired("system_conf_changed"),
          create => "true",
          handle => "_etc_systemd_system_conf";

        "/tmp/etc/profile"
          edit_line => set_line_based("global_env.etcprofile", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_profile";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload";
  }

  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent init
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    classes:
        "application_2" scope => "namespace";

    methods:
        "init";
        "global_env";

    reports:

        "CFEngine $(sys.cf_version)";
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My centralized management pattern example
#+BEGIN_EXAMPLE
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: SMS_AWS_REGION=eu-east-2
R: PAPERTRAIL_HOST=xxx.trailpaperapp.com
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: SMS_ENABLED=false
R: APPOPTICS_APIKEY=xxxxiiiiiiixxixxix
R: APPOPTICS_USER=ops@whatever.com
R: PAPERTRAIL_PORT=54321
R: CORE_JDBC_USER=vagrant
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_AWS_REGION=eu-east-2
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=APPOPTICS_APIKEY=xxxxiiiiiiixxixxix
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.trailpaperapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=54321
R: /tmp/etc/profile
R: export SMS_ENABLED=false
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export APPOPTICS_USER=ops@whatever.com
R: export CORE_JDBC_USER=vagrant
R: export SMS_AWS_REGION=eu-east-2
R: export PAPERTRAIL_PORT=54321
R: export APPOPTICS_APIKEY=xxxxiiiiiiixxixxix
R: export PAPERTRAIL_HOST=xxx.trailpaperapp.com
#+END_EXAMPLE

Common evolution's on this policy include moving variable definition into it's
own bundle, separating the data into external files, and since all data is known
at one time, full file management is an option.

