content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
** Centralized management separate data bundle

Here I am sure to have the data bundle converge before the bundle that will use
the data defined there. This separation enables more complex data convergence,
delegation of control, and especially with more data can improve the readability
of the policy.

*Policy:*

#+Caption: My centralized management pattern example with separate data bundle
#+Name: My centralized management pattern example with separate data bundle
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env
  {
    vars:

        "env_i" slist => getindices( "app_data.env" );
        # Here we take the original simple key value pair and add different prefixes
        # for the differnt config file types using a classic array as a generator.
        "systemconf[DefaultEnvironment=$(env_i)]" string => "$(app_data.env[$(env_i)])";
        "etcprofile[export $(env_i)]" string => "$(app_data.env[$(env_i)])";

    files:

        "/tmp/etc/environment"
          edit_line => set_line_based("app_data.env", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_environment";

        "/tmp/etc/systemd/system.conf"
          edit_line => set_line_based("$(this.bundle).systemconf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          classes   => if_repaired("system_conf_changed"),
          create => "true",
          handle => "_etc_systemd_system_conf";

        "/tmp/etc/profile"
          edit_line => set_line_based("$(this.bundle).etcprofile", "=", "\s*=\s*", ".*", "\s*#\s*"),
          create => "true",
          handle => "_etc_profile";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload";
  }
  bundle agent app_data
  {
    vars:
          vars:

      vagrant_vm::

        "env[PAPERTRAIL_HOST]"            string => "xxx.papertrailapp.com";
        "env[PAPERTRAIL_PORT]"            string => "12345";
        "env[APPOPTICS_USER]"            string => "ops@whatever.com";
        "env[APPOPTICS_APIKEY]"            string => "cafebabedeadbeef";
        "env[CORE_JDBC_URL]"            string => "jdbc:postgresql://localhost/xxx";
        "env[CORE_JDBC_USER]"            string => "vagrant";
        "env[SMS_ENABLED]"            string => "false";
        "env[SMS_AWS_REGION]"            string => "eu-west-1";

      application_2::

        "env[PAPERTRAIL_HOST]"            string => "xxx.trailpaperapp.com";
        "env[PAPERTRAIL_PORT]"            string => "54321";
        "env[APPOPTICS_USER]"            string => "ops@whatever.com";
        "env[APPOPTICS_APIKEY]"            string => "xxxxiiiiiiixxixxix";
        "env[CORE_JDBC_URL]"            string => "jdbc:postgresql://localhost/xxx";
        "env[CORE_JDBC_USER]"            string => "vagrant";
        "env[SMS_ENABLED]"            string => "false";
        "env[SMS_AWS_REGION]"            string => "eu-east-2";

  }

  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent init
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    classes:
        "vagrant_vm" expression => "any", scope => "namespace";

    methods:
        "init";
        "app_data";
        "global_env";

    reports:
        "CFEngine $(sys.cf_version)";
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My centralized management pattern example with separate data bundle
#+BEGIN_EXAMPLE
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: CORE_JDBC_USER=vagrant
R: PAPERTRAIL_PORT=12345
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: APPOPTICS_USER=ops@whatever.com
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=12345
R: /tmp/etc/profile
R: export SMS_ENABLED=false
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export APPOPTICS_USER=ops@whatever.com
R: export CORE_JDBC_USER=vagrant
R: export SMS_AWS_REGION=eu-west-1
R: export PAPERTRAIL_PORT=12345
R: export APPOPTICS_APIKEY=cafebabedeadbeef
R: export PAPERTRAIL_HOST=xxx.papertrailapp.com
#+END_EXAMPLE

