content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
** Centralized management separate data bundle with external data files

In addition to the benefits derived from separating data bundles external data
files can further enable delegation of control working much more easily with
external systems, reduces the size of the policy and improve policy readability,
and eases testing of policy. We can use the json, yaml or env file formats
interchangeably. CSV is also possible, but different parsing would be required.

*/tmp/env.env:*

#+CAPTION: /tmp/env.env
#+BEGIN_SRC conf :tangle /tmp/etc.env
  PAPERTRAIL_HOST="xxx.papertrailapp.com"
  PAPERTRAIL_PORT="11111"
  APPOPTICS_USER="ops@whatever.com"
  APPOPTICS_APIKEY="cafebabedeadbeef"
  CORE_JDBC_URL="jdbc:postgresql://localhost/xxx"
  CORE_JDBC_USER="vagrant"
  SMS_ENABLED="false"
  SMS_AWS_REGION="eu-west-1"
#+END_SRC

*/tmp/env.json:*

#+CAPTION: /tmp/env.json
#+BEGIN_SRC json :tangle /tmp/env.json
  {
    "PAPERTRAIL_HOST": "xxx.papertrailapp.com",
    "PAPERTRAIL_PORT": "11111",
    "APPOPTICS_USER": "ops@whatever.com",
    "APPOPTICS_APIKEY": "cafebabedeadbeef",
    "CORE_JDBC_URL": "jdbc:postgresql://localhost/xxx",
    "CORE_JDBC_USER": "vagrant",
    "SMS_ENABLED": "false",
    "SMS_AWS_REGION": "eu-west-1"
  }
#+END_SRC

*/tmp/env.yaml:*

#+CAPTION: /tmp/env.yaml
#+BEGIN_SRC yaml :tangle /tmp/env.yaml
  ---
  PAPERTRAIL_HOST: xxx.papertrailapp.com
  PAPERTRAIL_PORT: '11111'
  APPOPTICS_USER: ops@whatever.com
  APPOPTICS_APIKEY: cafebabedeadbeef
  CORE_JDBC_URL: jdbc:postgresql://localhost/xxx
  CORE_JDBC_USER: vagrant
  SMS_ENABLED: 'false'
  SMS_AWS_REGION: eu-west-1
#+END_SRC

*Policy:*

#+Caption: My centralized management pattern example with separate data files
#+NAME: My centralized management pattern example with separate data files
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env
  {
    vars:
        "env_i" slist => getindices( "app_data.env" );
        # Here we take the original simple key value pair and add different prefixes
        # for the differnt config file types using a classic array as a generator.
        "etc_systemd_conf[DefaultEnvironment=$(env_i)]" string => "$(app_data.env[$(env_i)])";
        "etc_profile[export $(env_i)]" string => "$(app_data.env[$(env_i)])";

    files:

        "/tmp/etc/environment"
          edit_line => set_line_based("app_data.env", "=", "\s*=\s*", ".*", "\s*#\s*"),
          edit_defaults => empty,
          create => "true",
          handle => "_etc_environment";

        "/tmp/etc/systemd/system.conf"
          edit_line => set_line_based("$(this.bundle).etc_systemd_conf", "=", "\s*=\s*", ".*", "\s*#\s*"),
          edit_defaults => empty,
          classes   => if_repaired("system_conf_changed"),
          create => "true",
          handle => "_etc_systemd_system_conf";

        "/tmp/etc/profile"
          edit_line => set_line_based("$(this.bundle).etc_profile", "export ", "\s*=\s*", ".*", "\s*#\s*"),
          edit_defaults => empty,
          create => "true",
          handle => "_etc_profile";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload";
  }
  bundle agent app_data
  {
    vars:
      vagrant_vm::

        "env" data => readdata( "/tmp/env.yaml", auto );

  }

  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent init
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    classes:
        "vagrant_vm" expression => "any", scope => "namespace";

    methods:
        #"init";
        "app_data";
        "global_env";

    reports:
        "CFEngine $(sys.cf_version)";
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My centralized management pattern example with separate data files
#+BEGIN_EXAMPLE
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: PAPERTRAIL_PORT=11111
R: APPOPTICS_USER=ops@whatever.com
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: CORE_JDBC_USER=vagrant
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=PAPERTRAIL_PORT=11111
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: /tmp/etc/profile
R: export PAPERTRAIL_HOSTexport xxx.papertrailapp.com
R: export SMS_AWS_REGIONexport eu-west-1
R: export PAPERTRAIL_PORTexport 11111
R: export APPOPTICS_USERexport ops@whatever.com
R: export SMS_ENABLEDexport false
R: export CORE_JDBC_USERexport vagrant
R: export CORE_JDBC_URLexport jdbc:postgresql://localhost/xxx
R: export APPOPTICS_APIKEYexport cafebabedeadbeef
#+END_EXAMPLE

