public/2018/11/10/looking-at-three-high-level-patterns-in-cfengine-3/index.html
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Centralized management separate data bundle with external data files
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
In addition to the benefits derived from separating data bundles external data
files can further enable delegation of control working much more easily with
external systems, reduces the size of the policy and improve policy readability,
and eases testing of policy. We can use the json, yaml or env file formats
interchangeably. CSV is also possible, but different parsing would be required.</p>
<p>
<strong>/tmp/env.env:</strong></p>
<figure>
<div class="src src-conf">
<pre tabindex="0"><code class="language-conf" data-lang="conf">  PAPERTRAIL_HOST=&#34;xxx.papertrailapp.com&#34;
  PAPERTRAIL_PORT=&#34;11111&#34;
  APPOPTICS_USER=&#34;ops@whatever.com&#34;
  APPOPTICS_APIKEY=&#34;cafebabedeadbeef&#34;
  CORE_JDBC_URL=&#34;jdbc:postgresql://localhost/xxx&#34;
  CORE_JDBC_USER=&#34;vagrant&#34;
  SMS_ENABLED=&#34;false&#34;
  SMS_AWS_REGION=&#34;eu-west-1&#34;</code></pre>
</div>
<figcaption>
/tmp/env.env
</figcaption>
</figure>
<p>
<strong>/tmp/env.json:</strong></p>
<figure>
<div class="src src-json">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-json" data-lang="json">  <span class="p">{</span>
    <span class="nt">&#34;PAPERTRAIL_HOST&#34;</span><span class="p">:</span> <span class="s2">&#34;xxx.papertrailapp.com&#34;</span><span class="p">,</span>
    <span class="nt">&#34;PAPERTRAIL_PORT&#34;</span><span class="p">:</span> <span class="s2">&#34;11111&#34;</span><span class="p">,</span>
    <span class="nt">&#34;APPOPTICS_USER&#34;</span><span class="p">:</span> <span class="s2">&#34;ops@whatever.com&#34;</span><span class="p">,</span>
    <span class="nt">&#34;APPOPTICS_APIKEY&#34;</span><span class="p">:</span> <span class="s2">&#34;cafebabedeadbeef&#34;</span><span class="p">,</span>
    <span class="nt">&#34;CORE_JDBC_URL&#34;</span><span class="p">:</span> <span class="s2">&#34;jdbc:postgresql://localhost/xxx&#34;</span><span class="p">,</span>
    <span class="nt">&#34;CORE_JDBC_USER&#34;</span><span class="p">:</span> <span class="s2">&#34;vagrant&#34;</span><span class="p">,</span>
    <span class="nt">&#34;SMS_ENABLED&#34;</span><span class="p">:</span> <span class="s2">&#34;false&#34;</span><span class="p">,</span>
    <span class="nt">&#34;SMS_AWS_REGION&#34;</span><span class="p">:</span> <span class="s2">&#34;eu-west-1&#34;</span>
  <span class="p">}</span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
/tmp/env.json
</figcaption>
</figure>
<p>
<strong>/tmp/env.yaml:</strong></p>
<figure>
<div class="src src-yaml">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt">1
</span><span class="lnt">2
</span><span class="lnt">3
</span><span class="lnt">4
</span><span class="lnt">5
</span><span class="lnt">6
</span><span class="lnt">7
</span><span class="lnt">8
</span><span class="lnt">9
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-yaml" data-lang="yaml"><span class="w">  </span>---<span class="w">
</span><span class="w">  </span><span class="nt">PAPERTRAIL_HOST</span><span class="p">:</span><span class="w"> </span><span class="l">xxx.papertrailapp.com</span><span class="w">
</span><span class="w">  </span><span class="nt">PAPERTRAIL_PORT</span><span class="p">:</span><span class="w"> </span><span class="s1">&#39;11111&#39;</span><span class="w">
</span><span class="w">  </span><span class="nt">APPOPTICS_USER</span><span class="p">:</span><span class="w"> </span><span class="l">ops@whatever.com</span><span class="w">
</span><span class="w">  </span><span class="nt">APPOPTICS_APIKEY</span><span class="p">:</span><span class="w"> </span><span class="l">cafebabedeadbeef</span><span class="w">
</span><span class="w">  </span><span class="nt">CORE_JDBC_URL</span><span class="p">:</span><span class="w"> </span><span class="l">jdbc:postgresql://localhost/xxx</span><span class="w">
</span><span class="w">  </span><span class="nt">CORE_JDBC_USER</span><span class="p">:</span><span class="w"> </span><span class="l">vagrant</span><span class="w">
</span><span class="w">  </span><span class="nt">SMS_ENABLED</span><span class="p">:</span><span class="w"> </span><span class="s1">&#39;false&#39;</span><span class="w">
</span><span class="w">  </span><span class="nt">SMS_AWS_REGION</span><span class="p">:</span><span class="w"> </span><span class="l">eu-west-1</span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
/tmp/env.yaml
</figcaption>
</figure>
<p>
<strong>Policy:</strong></p>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span><span class="lnt">35
</span><span class="lnt">36
</span><span class="lnt">37
</span><span class="lnt">38
</span><span class="lnt">39
</span><span class="lnt">40
</span><span class="lnt">41
</span><span class="lnt">42
</span><span class="lnt">43
</span><span class="lnt">44
</span><span class="lnt">45
</span><span class="lnt">46
</span><span class="lnt">47
</span><span class="lnt">48
</span><span class="lnt">49
</span><span class="lnt">50
</span><span class="lnt">51
</span><span class="lnt">52
</span><span class="lnt">53
</span><span class="lnt">54
</span><span class="lnt">55
</span><span class="lnt">56
</span><span class="lnt">57
</span><span class="lnt">58
</span><span class="lnt">59
</span><span class="lnt">60
</span><span class="lnt">61
</span><span class="lnt">62
</span><span class="lnt">63
</span><span class="lnt">64
</span><span class="lnt">65
</span><span class="lnt">66
</span><span class="lnt">67
</span><span class="lnt">68
</span><span class="lnt">69
</span><span class="lnt">70
</span><span class="lnt">71
</span><span class="lnt">72
</span><span class="lnt">73
</span><span class="lnt">74
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">global_env</span>
  <span class="p">{</span>
    <span class="kd">vars</span><span class="p">:</span>
        <span class="p">&#34;</span><span class="nv">env_i</span><span class="p">&#34;</span> <span class="kt">slist</span> <span class="o">=&gt;</span> <span class="nf">getindices</span><span class="p">(</span> <span class="s">&#34;app_data.env&#34;</span> <span class="p">);</span>
        <span class="c"># Here we take the original simple key value pair and add different prefixes
</span><span class="c"></span>        <span class="c"># for the differnt config file types using a classic array as a generator.
</span><span class="c"></span>        <span class="p">&#34;</span><span class="nv">etc_systemd_conf[DefaultEnvironment=$(env_i)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(app_data.env[$(env_i)])</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="p">&#34;</span><span class="nv">etc_profile[export $(env_i)]</span><span class="p">&#34;</span> <span class="kt">string</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(app_data.env[$(env_i)])</span><span class="s">&#34;</span><span class="p">;</span>

    <span class="kd">files</span><span class="p">:</span>

        <span class="s">&#34;/tmp/etc/environment&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;app_data.env&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">edit_defaults</span> <span class="o">=&gt;</span> <span class="nf">empty</span><span class="p">,</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_environment&#34;</span><span class="p">;</span>

        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;</span><span class="si">$(this.bundle)</span><span class="s">.etc_systemd_conf&#34;</span><span class="p">,</span> <span class="s">&#34;=&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">edit_defaults</span> <span class="o">=&gt;</span> <span class="nf">empty</span><span class="p">,</span>
          <span class="kr">classes</span>   <span class="o">=&gt;</span> <span class="nf">if_repaired</span><span class="p">(</span><span class="s">&#34;system_conf_changed&#34;</span><span class="p">),</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_systemd_system_conf&#34;</span><span class="p">;</span>

        <span class="s">&#34;/tmp/etc/profile&#34;</span>
          <span class="kr">edit_line</span> <span class="o">=&gt;</span> <span class="nf">set_line_based</span><span class="p">(</span><span class="s">&#34;</span><span class="si">$(this.bundle)</span><span class="s">.etc_profile&#34;</span><span class="p">,</span> <span class="s">&#34;export &#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*=</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">,</span> <span class="s">&#34;.*&#34;</span><span class="p">,</span> <span class="s">&#34;</span><span class="se">\s</span><span class="s">*#</span><span class="se">\s</span><span class="s">*&#34;</span><span class="p">),</span>
          <span class="kr">edit_defaults</span> <span class="o">=&gt;</span> <span class="nf">empty</span><span class="p">,</span>
          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_etc_profile&#34;</span><span class="p">;</span>

    <span class="kd">commands</span><span class="p">:</span>
      <span class="nc">system_conf_changed</span><span class="p">::</span>
        <span class="s">&#34;/sbin/systemctl daemon-reload&#34;</span>
          <span class="kr">contain</span> <span class="o">=&gt;</span> <span class="nf">exec_owner</span><span class="p">(</span><span class="s">&#34;root&#34;</span><span class="p">),</span>
          <span class="kr">if</span> <span class="o">=&gt;</span> <span class="nf">strcmp</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(sys.user_data[username])</span><span class="s">&#34;</span><span class="p">,</span> <span class="s">&#34;root&#34;</span> <span class="p">),</span>
          <span class="kr">handle</span> <span class="o">=&gt;</span> <span class="s">&#34;_sbin_systemctl_daemon_reload&#34;</span><span class="p">;</span>
  <span class="p">}</span>
  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">app_data</span>
  <span class="p">{</span>
    <span class="kd">vars</span><span class="p">:</span>
      <span class="nc">vagrant_vm</span><span class="p">::</span>

        <span class="s">&#34;env&#34;</span> <span class="kr">data</span> <span class="o">=&gt;</span> <span class="nf">readdata</span><span class="p">(</span> <span class="s">&#34;/tmp/env.yaml&#34;</span><span class="p">,</span> <span class="nf">auto</span> <span class="p">);</span>

  <span class="p">}</span>

  <span class="k">body</span> <span class="k">contain</span> <span class="nf">exec_owner</span><span class="p">(</span><span class="nv">user</span><span class="p">)</span>
  <span class="p">{</span>
          <span class="kr">exec_owner</span> <span class="o">=&gt;</span> <span class="s">&#34;</span><span class="si">$(user)</span><span class="s">&#34;</span><span class="p">;</span>
  <span class="p">}</span>

  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">init</span>
  <span class="p">{</span>
    <span class="kd">files</span><span class="p">:</span>
        <span class="s">&#34;/tmp/etc/environment&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/profile&#34;</span> <span class="kr">delete</span> <span class="o">=&gt;</span> <span class="nf">tidy</span><span class="p">;</span>
  <span class="p">}</span>
  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">__main__</span>
  <span class="p">{</span>
    <span class="kd">classes</span><span class="p">:</span>
        <span class="s">&#34;vagrant_vm&#34;</span> <span class="kr">expression</span> <span class="o">=&gt;</span> <span class="s">&#34;any&#34;</span><span class="p">,</span> <span class="kr">scope</span> <span class="o">=&gt;</span> <span class="s">&#34;namespace&#34;</span><span class="p">;</span>

    <span class="kd">methods</span><span class="p">:</span>
        <span class="c">#&#34;init&#34;;
</span><span class="c"></span>        <span class="s">&#34;app_data&#34;</span><span class="p">;</span>
        <span class="s">&#34;global_env&#34;</span><span class="p">;</span>

    <span class="kd">reports</span><span class="p">:</span>
        <span class="s">&#34;CFEngine </span><span class="si">$(sys.cf_version)</span><span class="s">&#34;</span><span class="p">;</span>
        <span class="s">&#34;/tmp/etc/environment&#34;</span>         <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
        <span class="s">&#34;/tmp/etc/systemd/system.conf&#34;</span> <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
        <span class="s">&#34;/tmp/etc/profile&#34;</span>             <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="s">&#34;</span><span class="si">$(this.promiser)</span><span class="s">&#34;</span> <span class="p">);</span>
  <span class="p">}</span></code></pre></td></tr></table>
</div>
</div>
</div>
<p>
<strong>Output:</strong></p>
<pre class="example">
R: CFEngine 3.12.0
R: /tmp/etc/environment
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: PAPERTRAIL_PORT=11111
R: APPOPTICS_USER=ops@whatever.com
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: CORE_JDBC_USER=vagrant
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: /tmp/etc/systemd/system.conf
R: DefaultEnvironment=PAPERTRAIL_PORT=11111
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: /tmp/etc/profile
R: export PAPERTRAIL_HOSTexport xxx.papertrailapp.com
R: export SMS_AWS_REGIONexport eu-west-1
R: export PAPERTRAIL_PORTexport 11111
R: export APPOPTICS_USERexport ops@whatever.com
R: export SMS_ENABLEDexport false
R: export CORE_JDBC_USERexport vagrant
R: export CORE_JDBC_URLexport jdbc:postgresql://localhost/xxx
R: export APPOPTICS_APIKEYexport cafebabedeadbeef
</pre>
</div>
</div>
</div>
</div>
