content/post/2018-11-10-looking-at-three-high-level-patterns-in-cfengine-3.org
* Cooperative management
Here we allow each service to define the key values they need. They /advertise/
or /publish/ their data by tagging it. In this iteration, since we have full
knowledge of the desired state at one time we switched the file promises to be
templates so that the full content is managed. This helps to avoid unknown
settings.

*Policy:*

#+Caption: My cooperative management pattern example 
#+Name: My cooperative management pattern example 
#+BEGIN_SRC cfengine3 :exports both
  bundle agent global_env
  {
    vars:
        # Collect a datastrucutre from variables tagged as used_by this bundle
        "env"
          data => variablesmatching_as_data( ".*", "used_by=global_env" );

        # Get the index of the collected data (the variable names) in lexically
        # sorted order so that we can iterate over them
        "i" slist => sort( getindices( env ), lex );

        # Here we merge all the objects together by picking out each objects data
        # and merging on top. NOTE In event of conflict the last definition
        # alphabetically wins

        "c" data => '[]';
        "c" data => mergedata( c, mergedata( "env[$(i)]"));

    files:

        "/tmp/etc/environment"
          create => "true",
          template_method => "inline_mustache",
          template_data => @(c),
          edit_template_string => "{{#-top-}}{{{@}}}={{{.}}}$(const.n){{/-top-}}";

        "/tmp/etc/systemd/system.conf"
          create => "true",
          template_method => "inline_mustache",
          template_data => @(c),
          edit_template_string => "{{#-top-}}DefaultEnvironment={{{@}}}={{{.}}}$(const.n){{/-top-}}";

        "/tmp/etc/profile"
          create => "true",
          template_method => "inline_mustache",
          template_data => @(c),
          edit_template_string => "{{#-top-}}export {{{@}}}={{{.}}}$(const.n){{/-top-}}";

    commands:
      system_conf_changed::
        "/sbin/systemctl daemon-reload"
          contain => exec_owner("root"),
          if => strcmp( "$(sys.user_data[username])", "root" ),
          handle => "_sbin_systemctl_daemon_reload_$(name)_$(value)";
  }
  bundle agent vagrant_vm
  {
    vars:

        "v" data =>  '{
                        "PAPERTRAIL_HOST": "xxx.papertrailapp.com",
                        "PAPERTRAIL_PORT": "11111",
                        "APPOPTICS_USER": "ops@whatever.com",
                        "APPOPTICS_APIKEY": "cafebabedeadbeef",
                        "CORE_JDBC_URL": "jdbc:postgresql://localhost/xxx",
                        "CORE_JDBC_USER": "vagrant",
                        "SMS_ENABLED": "false",
                        "SMS_AWS_REGION": "eu-west-1"
        }',
          meta => { "used_by=global_env" };
  }

  bundle agent application_2
  {
    vars:

        "v" data =>  '{
                        "PAPERTRAIL_HOST": "xxx.trailpaperapp.com",
                        "PAPERTRAIL_PORT": "22222",
                        "APPOPTICS_USER": "ops@cfengine.com",
                        "APPOPTICS_APIKEY": "toodledum",
                        "CORE_JDBC_URL": "jdbc:postgresql://localhost/xxx",
                        "CORE_JDBC_USER": "vagrant",
                        "SMS_ENABLED": "false",
                        "SMS_AWS_REGION": "eu-west-1"
        }',
          meta => { "used_by=global_env" };
  }


  body contain exec_owner(user)
  {
          exec_owner => "$(user)";
  }

  bundle agent init
  {
    files:
        "/tmp/etc/environment" delete => tidy;
        "/tmp/etc/systemd/system.conf" delete => tidy;
        "/tmp/etc/profile" delete => tidy;
  }
  bundle agent __main__
  {
    classes:
        "vagrant_vm" scope => "namespace";

    methods:
        #"init";
        "global_env";

    reports:
        "/tmp/etc/environment"         printfile => cat( "$(this.promiser)" );
        "/tmp/etc/systemd/system.conf" printfile => cat( "$(this.promiser)" );
        "/tmp/etc/profile"             printfile => cat( "$(this.promiser)" );
  }
#+END_SRC

*Output:*

#+RESULTS: My cooperative management pattern example
#+BEGIN_EXAMPLE
R: /etc/environment
R: PAPERTRAIL_HOST=xxx.papertrailapp.com
R: PAPERTRAIL_PORT=11111
R: APPOPTICS_USER=ops@whatever.com
R: APPOPTICS_APIKEY=cafebabedeadbeef
R: CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: CORE_JDBC_USER=vagrant
R: SMS_ENABLED=false
R: SMS_AWS_REGION=eu-west-1
R: /etc/systemd/system.conf
R: DefaultEnvironment=PAPERTRAIL_HOST=xxx.papertrailapp.com
R: DefaultEnvironment=PAPERTRAIL_PORT=11111
R: DefaultEnvironment=APPOPTICS_USER=ops@whatever.com
R: DefaultEnvironment=APPOPTICS_APIKEY=cafebabedeadbeef
R: DefaultEnvironment=CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: DefaultEnvironment=CORE_JDBC_USER=vagrant
R: DefaultEnvironment=SMS_ENABLED=false
R: DefaultEnvironment=SMS_AWS_REGION=eu-west-1
R: /etc/profile
R: export PAPERTRAIL_HOST=xxx.papertrailapp.com
R: export PAPERTRAIL_PORT=11111
R: export APPOPTICS_USER=ops@whatever.com
R: export APPOPTICS_APIKEY=cafebabedeadbeef
R: export CORE_JDBC_URL=jdbc:postgresql://localhost/xxx
R: export CORE_JDBC_USER=vagrant
R: export SMS_ENABLED=false
R: export SMS_AWS_REGION=eu-west-1
#+END_EXAMPLE

As with other patterns moving the data into external files would improve
delegation of control and tighter integration with other systems.

